Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/can.h
#define CAN_TXBCIE_CFIE_Pos                   _UINT32_(0)                                          /* (CAN_TXBCIE Position) Cancellation Finished Interrupt Enable 3x */
#define CAN_TXBCIE_CFIE_Msk                   (_UINT32_(0xFFFFFFFF) << CAN_TXBCIE_CFIE_Pos)        /* (CAN_TXBCIE Mask) CFIE */
#define CAN_TXBCIE_CFIE(value)                (CAN_TXBCIE_CFIE_Msk & (_UINT32_(value) << CAN_TXBCIE_CFIE_Pos)) 

/* -------- CAN_TXEFC : (CAN Offset: 0x1F0) (R/W 32) Tx Event FIFO Configuration -------- */
#define CAN_TXEFC_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAN_TXEFC) Tx Event FIFO Configuration  Reset Value */

#define CAN_TXEFC_EFSA_Pos                    _UINT32_(2)                                          /* (CAN_TXEFC) Event FIFO Start Address Position */
#define CAN_TXEFC_EFSA_Msk                    (_UINT32_(0x3FFF) << CAN_TXEFC_EFSA_Pos)             /* (CAN_TXEFC) Event FIFO Start Address Mask */
#define CAN_TXEFC_EFSA(value)                 (CAN_TXEFC_EFSA_Msk & (_UINT32_(value) << CAN_TXEFC_EFSA_Pos)) /* Assignment of value for EFSA in the CAN_TXEFC register */
#define CAN_TXEFC_EFS_Pos                     _UINT32_(16)                                         /* (CAN_TXEFC) Event FIFO Size Position */
#define CAN_TXEFC_EFS_Msk                     (_UINT32_(0x3F) << CAN_TXEFC_EFS_Pos)                /* (CAN_TXEFC) Event FIFO Size Mask */
#define CAN_TXEFC_EFS(value)                  (CAN_TXEFC_EFS_Msk & (_UINT32_(value) << CAN_TXEFC_EFS_Pos)) /* Assignment of value for EFS in the CAN_TXEFC register */
#define CAN_TXEFC_EFWM_Pos                    _UINT32_(24)                                         /* (CAN_TXEFC) Event FIFO Watermark Position */
#define CAN_TXEFC_EFWM_Msk                    (_UINT32_(0x3F) << CAN_TXEFC_EFWM_Pos)               /* (CAN_TXEFC) Event FIFO Watermark Mask */
#define CAN_TXEFC_EFWM(value)                 (CAN_TXEFC_EFWM_Msk & (_UINT32_(value) << CAN_TXEFC_EFWM_Pos)) /* Assignment of value for EFWM in the CAN_TXEFC register */
#define CAN_TXEFC_Msk                         _UINT32_(0x3F3FFFFC)                                 /* (CAN_TXEFC) Register Mask  */


/* -------- CAN_TXEFS : (CAN Offset: 0x1F4) ( R/ 32) Tx Event FIFO Status -------- */
#define CAN_TXEFS_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAN_TXEFS) Tx Event FIFO Status  Reset Value */

#define CAN_TXEFS_EFFL_Pos                    _UINT32_(0)                                          /* (CAN_TXEFS) Event FIFO Fill Level Position */
#define CAN_TXEFS_EFFL_Msk                    (_UINT32_(0x3F) << CAN_TXEFS_EFFL_Pos)               /* (CAN_TXEFS) Event FIFO Fill Level Mask */
#define CAN_TXEFS_EFFL(value)                 (CAN_TXEFS_EFFL_Msk & (_UINT32_(value) << CAN_TXEFS_EFFL_Pos)) /* Assignment of value for EFFL in the CAN_TXEFS register */
#define CAN_TXEFS_EFGI_Pos                    _UINT32_(8)                                          /* (CAN_TXEFS) Event FIFO Get Index Position */
#define CAN_TXEFS_EFGI_Msk                    (_UINT32_(0x1F) << CAN_TXEFS_EFGI_Pos)               /* (CAN_TXEFS) Event FIFO Get Index Mask */
#define CAN_TXEFS_EFGI(value)                 (CAN_TXEFS_EFGI_Msk & (_UINT32_(value) << CAN_TXEFS_EFGI_Pos)) /* Assignment of value for EFGI in the CAN_TXEFS register */
#define CAN_TXEFS_EFPI_Pos                    _UINT32_(16)                                         /* (CAN_TXEFS) Event FIFO Put Index Position */
#define CAN_TXEFS_EFPI_Msk                    (_UINT32_(0x1F) << CAN_TXEFS_EFPI_Pos)               /* (CAN_TXEFS) Event FIFO Put Index Mask */
#define CAN_TXEFS_EFPI(value)                 (CAN_TXEFS_EFPI_Msk & (_UINT32_(value) << CAN_TXEFS_EFPI_Pos)) /* Assignment of value for EFPI in the CAN_TXEFS register */
#define CAN_TXEFS_EFF_Pos                     _UINT32_(24)                                         /* (CAN_TXEFS) Event FIFO Full Position */
#define CAN_TXEFS_EFF_Msk                     (_UINT32_(0x1) << CAN_TXEFS_EFF_Pos)                 /* (CAN_TXEFS) Event FIFO Full Mask */
#define CAN_TXEFS_EFF(value)                  (CAN_TXEFS_EFF_Msk & (_UINT32_(value) << CAN_TXEFS_EFF_Pos)) /* Assignment of value for EFF in the CAN_TXEFS register */
#define CAN_TXEFS_TEFL_Pos                    _UINT32_(25)                                         /* (CAN_TXEFS) Tx Event FIFO Element Lost Position */
#define CAN_TXEFS_TEFL_Msk                    (_UINT32_(0x1) << CAN_TXEFS_TEFL_Pos)                /* (CAN_TXEFS) Tx Event FIFO Element Lost Mask */
#define CAN_TXEFS_TEFL(value)                 (CAN_TXEFS_TEFL_Msk & (_UINT32_(value) << CAN_TXEFS_TEFL_Pos)) /* Assignment of value for TEFL in the CAN_TXEFS register */
#define CAN_TXEFS_Msk                         _UINT32_(0x031F1F3F)                                 /* (CAN_TXEFS) Register Mask  */


/* -------- CAN_TXEFA : (CAN Offset: 0x1F8) (R/W 32) Tx Event FIFO Acknowledge -------- */
#define CAN_TXEFA_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAN_TXEFA) Tx Event FIFO Acknowledge  Reset Value */

#define CAN_TXEFA_EFAI_Pos                    _UINT32_(0)                                          /* (CAN_TXEFA) Event FIFO Acknowledge Index Position */
#define CAN_TXEFA_EFAI_Msk                    (_UINT32_(0x1F) << CAN_TXEFA_EFAI_Pos)               /* (CAN_TXEFA) Event FIFO Acknowledge Index Mask */
#define CAN_TXEFA_EFAI(value)                 (CAN_TXEFA_EFAI_Msk & (_UINT32_(value) << CAN_TXEFA_EFAI_Pos)) /* Assignment of value for EFAI in the CAN_TXEFA register */
#define CAN_TXEFA_Msk                         _UINT32_(0x0000001F)                                 /* (CAN_TXEFA) Register Mask  */


/* -------- CAN_CREL_TSU : (CAN Offset: 0x260) ( R/ 32) TSU CREL -------- */
#define CAN_CREL_TSU_RESETVALUE               _UINT32_(0x10000000)                                 /*  (CAN_CREL_TSU) TSU CREL  Reset Value */

#define CAN_CREL_TSU_DAY_Pos                  _UINT32_(0)                                          /* (CAN_CREL_TSU) Timestamp Day Position */
#define CAN_CREL_TSU_DAY_Msk                  (_UINT32_(0xFF) << CAN_CREL_TSU_DAY_Pos)             /* (CAN_CREL_TSU) Timestamp Day Mask */
#define CAN_CREL_TSU_DAY(value)               (CAN_CREL_TSU_DAY_Msk & (_UINT32_(value) << CAN_CREL_TSU_DAY_Pos)) /* Assignment of value for DAY in the CAN_CREL_TSU register */
#define CAN_CREL_TSU_MON_Pos                  _UINT32_(8)                                          /* (CAN_CREL_TSU) Timestamp Month Position */
#define CAN_CREL_TSU_MON_Msk                  (_UINT32_(0xFF) << CAN_CREL_TSU_MON_Pos)             /* (CAN_CREL_TSU) Timestamp Month Mask */
#define CAN_CREL_TSU_MON(value)               (CAN_CREL_TSU_MON_Msk & (_UINT32_(value) << CAN_CREL_TSU_MON_Pos)) /* Assignment of value for MON in the CAN_CREL_TSU register */
#define CAN_CREL_TSU_YEAR_Pos                 _UINT32_(16)                                         /* (CAN_CREL_TSU) Timestamp Year Position */
#define CAN_CREL_TSU_YEAR_Msk                 (_UINT32_(0xF) << CAN_CREL_TSU_YEAR_Pos)             /* (CAN_CREL_TSU) Timestamp Year Mask */
#define CAN_CREL_TSU_YEAR(value)              (CAN_CREL_TSU_YEAR_Msk & (_UINT32_(value) << CAN_CREL_TSU_YEAR_Pos)) /* Assignment of value for YEAR in the CAN_CREL_TSU register */
#define CAN_CREL_TSU_SUBSTEP_Pos              _UINT32_(20)                                         /* (CAN_CREL_TSU) Sub-step of Core Release Position */
#define CAN_CREL_TSU_SUBSTEP_Msk              (_UINT32_(0xF) << CAN_CREL_TSU_SUBSTEP_Pos)          /* (CAN_CREL_TSU) Sub-step of Core Release Mask */
#define CAN_CREL_TSU_SUBSTEP(value)           (CAN_CREL_TSU_SUBSTEP_Msk & (_UINT32_(value) << CAN_CREL_TSU_SUBSTEP_Pos)) /* Assignment of value for SUBSTEP in the CAN_CREL_TSU register */
#define CAN_CREL_TSU_STEP_Pos                 _UINT32_(24)                                         /* (CAN_CREL_TSU) Step of Core Release Position */
#define CAN_CREL_TSU_STEP_Msk                 (_UINT32_(0xF) << CAN_CREL_TSU_STEP_Pos)             /* (CAN_CREL_TSU) Step of Core Release Mask */
#define CAN_CREL_TSU_STEP(value)              (CAN_CREL_TSU_STEP_Msk & (_UINT32_(value) << CAN_CREL_TSU_STEP_Pos)) /* Assignment of value for STEP in the CAN_CREL_TSU register */
#define CAN_CREL_TSU_REL_Pos                  _UINT32_(28)                                         /* (CAN_CREL_TSU) Core Release Position */
#define CAN_CREL_TSU_REL_Msk                  (_UINT32_(0xF) << CAN_CREL_TSU_REL_Pos)              /* (CAN_CREL_TSU) Core Release Mask */
#define CAN_CREL_TSU_REL(value)               (CAN_CREL_TSU_REL_Msk & (_UINT32_(value) << CAN_CREL_TSU_REL_Pos)) /* Assignment of value for REL in the CAN_CREL_TSU register */
#define CAN_CREL_TSU_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CAN_CREL_TSU) Register Mask  */


/* -------- CAN_TSCFG : (CAN Offset: 0x264) (R/W 32) Timestamp Configuration -------- */
#define CAN_TSCFG_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAN_TSCFG) Timestamp Configuration  Reset Value */

#define CAN_TSCFG_TSUE_Pos                    _UINT32_(0)                                          /* (CAN_TSCFG) Timestamp Unit Enable Position */
#define CAN_TSCFG_TSUE_Msk                    (_UINT32_(0x1) << CAN_TSCFG_TSUE_Pos)                /* (CAN_TSCFG) Timestamp Unit Enable Mask */
#define CAN_TSCFG_TSUE(value)                 (CAN_TSCFG_TSUE_Msk & (_UINT32_(value) << CAN_TSCFG_TSUE_Pos)) /* Assignment of value for TSUE in the CAN_TSCFG register */
#define CAN_TSCFG_TBCS_Pos                    _UINT32_(1)                                          /* (CAN_TSCFG) Timebase Counter Select Position */
#define CAN_TSCFG_TBCS_Msk                    (_UINT32_(0x1) << CAN_TSCFG_TBCS_Pos)                /* (CAN_TSCFG) Timebase Counter Select Mask */
#define CAN_TSCFG_TBCS(value)                 (CAN_TSCFG_TBCS_Msk & (_UINT32_(value) << CAN_TSCFG_TBCS_Pos)) /* Assignment of value for TBCS in the CAN_TSCFG register */
#define CAN_TSCFG_SCP_Pos                     _UINT32_(2)                                          /* (CAN_TSCFG) Select Capturing Position Position */
#define CAN_TSCFG_SCP_Msk                     (_UINT32_(0x1) << CAN_TSCFG_SCP_Pos)                 /* (CAN_TSCFG) Select Capturing Position Mask */
#define CAN_TSCFG_SCP(value)                  (CAN_TSCFG_SCP_Msk & (_UINT32_(value) << CAN_TSCFG_SCP_Pos)) /* Assignment of value for SCP in the CAN_TSCFG register */
#define CAN_TSCFG_TBPRE_Pos                   _UINT32_(8)                                          /* (CAN_TSCFG) Time Base Prescaler Position */
#define CAN_TSCFG_TBPRE_Msk                   (_UINT32_(0xFF) << CAN_TSCFG_TBPRE_Pos)              /* (CAN_TSCFG) Time Base Prescaler Mask */
#define CAN_TSCFG_TBPRE(value)                (CAN_TSCFG_TBPRE_Msk & (_UINT32_(value) << CAN_TSCFG_TBPRE_Pos)) /* Assignment of value for TBPRE in the CAN_TSCFG register */
#define CAN_TSCFG_Msk                         _UINT32_(0x0000FF07)                                 /* (CAN_TSCFG) Register Mask  */


