Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/can.h
/* -------- CAN_TSS1 : (CAN Offset: 0x268) ( R/ 32) Timestamp Status 1 -------- */
#define CAN_TSS1_RESETVALUE                   _UINT32_(0x00)                                       /*  (CAN_TSS1) Timestamp Status 1  Reset Value */

#define CAN_TSS1_TSL_Pos                      _UINT32_(0)                                          /* (CAN_TSS1) Timestamp Lost Position */
#define CAN_TSS1_TSL_Msk                      (_UINT32_(0xFFFF) << CAN_TSS1_TSL_Pos)               /* (CAN_TSS1) Timestamp Lost Mask */
#define CAN_TSS1_TSL(value)                   (CAN_TSS1_TSL_Msk & (_UINT32_(value) << CAN_TSS1_TSL_Pos)) /* Assignment of value for TSL in the CAN_TSS1 register */
#define CAN_TSS1_TSN_Pos                      _UINT32_(16)                                         /* (CAN_TSS1) Timestamp New Position */
#define CAN_TSS1_TSN_Msk                      (_UINT32_(0xFFFF) << CAN_TSS1_TSN_Pos)               /* (CAN_TSS1) Timestamp New Mask */
#define CAN_TSS1_TSN(value)                   (CAN_TSS1_TSN_Msk & (_UINT32_(value) << CAN_TSS1_TSN_Pos)) /* Assignment of value for TSN in the CAN_TSS1 register */
#define CAN_TSS1_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CAN_TSS1) Register Mask  */


/* -------- CAN_TSS2 : (CAN Offset: 0x26C) ( R/ 32) Timestamp Status 2 -------- */
#define CAN_TSS2_RESETVALUE                   _UINT32_(0xA000)                                     /*  (CAN_TSS2) Timestamp Status 2  Reset Value */

#define CAN_TSS2_TSP_Pos                      _UINT32_(0)                                          /* (CAN_TSS2) Timestamp Pointer Position */
#define CAN_TSS2_TSP_Msk                      (_UINT32_(0xF) << CAN_TSS2_TSP_Pos)                  /* (CAN_TSS2) Timestamp Pointer Mask */
#define CAN_TSS2_TSP(value)                   (CAN_TSS2_TSP_Msk & (_UINT32_(value) << CAN_TSS2_TSP_Pos)) /* Assignment of value for TSP in the CAN_TSS2 register */
#define CAN_TSS2_NTSG_Pos                     _UINT32_(12)                                         /* (CAN_TSS2) Number of Timestamps Generic Position */
#define CAN_TSS2_NTSG_Msk                     (_UINT32_(0x3) << CAN_TSS2_NTSG_Pos)                 /* (CAN_TSS2) Number of Timestamps Generic Mask */
#define CAN_TSS2_NTSG(value)                  (CAN_TSS2_NTSG_Msk & (_UINT32_(value) << CAN_TSS2_NTSG_Pos)) /* Assignment of value for NTSG in the CAN_TSS2 register */
#define CAN_TSS2_ITBG_Pos                     _UINT32_(14)                                         /* (CAN_TSS2) Internal Timebase and SOF select Generic Position */
#define CAN_TSS2_ITBG_Msk                     (_UINT32_(0x3) << CAN_TSS2_ITBG_Pos)                 /* (CAN_TSS2) Internal Timebase and SOF select Generic Mask */
#define CAN_TSS2_ITBG(value)                  (CAN_TSS2_ITBG_Msk & (_UINT32_(value) << CAN_TSS2_ITBG_Pos)) /* Assignment of value for ITBG in the CAN_TSS2 register */
#define CAN_TSS2_Msk                          _UINT32_(0x0000F00F)                                 /* (CAN_TSS2) Register Mask  */


/* -------- CAN_TS0 : (CAN Offset: 0x270) ( R/ 32) Timestamp 0 -------- */
#define CAN_TS0_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS0) Timestamp 0  Reset Value */

#define CAN_TS0_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS0) Timestamp Word TS0 Position */
#define CAN_TS0_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS0_TS_Pos)             /* (CAN_TS0) Timestamp Word TS0 Mask */
#define CAN_TS0_TS(value)                     (CAN_TS0_TS_Msk & (_UINT32_(value) << CAN_TS0_TS_Pos)) /* Assignment of value for TS in the CAN_TS0 register */
#define CAN_TS0_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS0) Register Mask  */


/* -------- CAN_TS1 : (CAN Offset: 0x274) ( R/ 32) Timestamp 1 -------- */
#define CAN_TS1_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS1) Timestamp 1  Reset Value */

#define CAN_TS1_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS1) Timestamp Word TS1 Position */
#define CAN_TS1_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS1_TS_Pos)             /* (CAN_TS1) Timestamp Word TS1 Mask */
#define CAN_TS1_TS(value)                     (CAN_TS1_TS_Msk & (_UINT32_(value) << CAN_TS1_TS_Pos)) /* Assignment of value for TS in the CAN_TS1 register */
#define CAN_TS1_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS1) Register Mask  */


/* -------- CAN_TS2 : (CAN Offset: 0x278) ( R/ 32) Timestamp 2 -------- */
#define CAN_TS2_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS2) Timestamp 2  Reset Value */

#define CAN_TS2_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS2) Timestamp Word TS2 Position */
#define CAN_TS2_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS2_TS_Pos)             /* (CAN_TS2) Timestamp Word TS2 Mask */
#define CAN_TS2_TS(value)                     (CAN_TS2_TS_Msk & (_UINT32_(value) << CAN_TS2_TS_Pos)) /* Assignment of value for TS in the CAN_TS2 register */
#define CAN_TS2_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS2) Register Mask  */


/* -------- CAN_TS3 : (CAN Offset: 0x27C) ( R/ 32) Timestamp 3 -------- */
#define CAN_TS3_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS3) Timestamp 3  Reset Value */

#define CAN_TS3_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS3) Timestamp Word TS0 Position */
#define CAN_TS3_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS3_TS_Pos)             /* (CAN_TS3) Timestamp Word TS0 Mask */
#define CAN_TS3_TS(value)                     (CAN_TS3_TS_Msk & (_UINT32_(value) << CAN_TS3_TS_Pos)) /* Assignment of value for TS in the CAN_TS3 register */
#define CAN_TS3_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS3) Register Mask  */


/* -------- CAN_TS4 : (CAN Offset: 0x280) ( R/ 32) Timestamp 4 -------- */
#define CAN_TS4_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS4) Timestamp 4  Reset Value */

#define CAN_TS4_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS4) Timestamp Word TS4 Position */
#define CAN_TS4_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS4_TS_Pos)             /* (CAN_TS4) Timestamp Word TS4 Mask */
#define CAN_TS4_TS(value)                     (CAN_TS4_TS_Msk & (_UINT32_(value) << CAN_TS4_TS_Pos)) /* Assignment of value for TS in the CAN_TS4 register */
#define CAN_TS4_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS4) Register Mask  */


/* -------- CAN_TS5 : (CAN Offset: 0x284) ( R/ 32) Timestamp 5 -------- */
#define CAN_TS5_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS5) Timestamp 5  Reset Value */

#define CAN_TS5_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS5) Timestamp Word TS5 Position */
#define CAN_TS5_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS5_TS_Pos)             /* (CAN_TS5) Timestamp Word TS5 Mask */
#define CAN_TS5_TS(value)                     (CAN_TS5_TS_Msk & (_UINT32_(value) << CAN_TS5_TS_Pos)) /* Assignment of value for TS in the CAN_TS5 register */
#define CAN_TS5_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS5) Register Mask  */


/* -------- CAN_TS6 : (CAN Offset: 0x288) ( R/ 32) Timestamp 6 -------- */
#define CAN_TS6_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS6) Timestamp 6  Reset Value */

#define CAN_TS6_TS_Pos                        _UINT32_(0)                                          /* (CAN_TS6) Timestamp Word TS6 Position */
#define CAN_TS6_TS_Msk                        (_UINT32_(0xFFFFFFFF) << CAN_TS6_TS_Pos)             /* (CAN_TS6) Timestamp Word TS6 Mask */
#define CAN_TS6_TS(value)                     (CAN_TS6_TS_Msk & (_UINT32_(value) << CAN_TS6_TS_Pos)) /* Assignment of value for TS in the CAN_TS6 register */
#define CAN_TS6_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CAN_TS6) Register Mask  */


/* -------- CAN_TS7 : (CAN Offset: 0x28C) ( R/ 32) Timestamp 7 -------- */
#define CAN_TS7_RESETVALUE                    _UINT32_(0x00)                                       /*  (CAN_TS7) Timestamp 7  Reset Value */

