Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/can.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* CAN_MRAM_RXBE register API structure */
typedef struct
{  /* Control Area Network */
  __IO  uint32_t                       CAN_R0;             /* Offset: 0x00 (R/W  32) Rx Buffer and FIFO Element 0 */
  __IO  uint32_t                       CAN_R1;             /* Offset: 0x04 (R/W  32) Rx Buffer and FIFO Element 1 */
  __IO  uint32_t                       CAN_R2[16];         /* Offset: 0x08 (R/W  32) Rx Buffer and FIFO Element Data */
} can_mram_rxbe_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/* CAN_MRAM_SIDFE register API structure */
typedef struct
{  /* Control Area Network */
  __IO  uint32_t                       CAN_S0;             /* Offset: 0x00 (R/W  32) Standard Message ID Filter Element */
} can_mram_sidfe_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/* CAN_MRAM_TXBE register API structure */
typedef struct
{  /* Control Area Network */
  __IO  uint32_t                       CAN_T0;             /* Offset: 0x00 (R/W  32) Tx Buffer Element 0 */
  __IO  uint32_t                       CAN_T1;             /* Offset: 0x04 (R/W  32) Tx Buffer Element 1 */
  __IO  uint32_t                       CAN_T2[16];         /* Offset: 0x08 (R/W  32) Tx Buffer Element Data */
} can_mram_txbe_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/* CAN_MRAM_TXEFE register API structure */
typedef struct
{  /* Control Area Network */
  __IO  uint32_t                       CAN_E0;             /* Offset: 0x00 (R/W  32) Tx Event FIFO Element 0 */
  __IO  uint32_t                       CAN_E1;             /* Offset: 0x04 (R/W  32) Tx Event FIFO Element 1 */
} can_mram_txefe_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/* CAN_MRAM_XIDFE register API structure */
typedef struct
{  /* Control Area Network */
  __IO  uint32_t                       CAN_F0;             /* Offset: 0x00 (R/W  32) Extended Message ID Filter Element 0 */
  __IO  uint32_t                       CAN_F1;             /* Offset: 0x04 (R/W  32) Extended Message ID Filter Element 1 */
} can_mram_xidfe_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/* CAN register API structure */
typedef struct
{  /* Control Area Network */
  __IO  uint32_t                       CAN_CTRLA;          /* Offset: 0x00 (R/W  32) Control A Register */
  __IO  uint32_t                       CAN_CTRLB;          /* Offset: 0x04 (R/W  32) Control B Register */
  __I   uint8_t                        Reserved1[0x20];
  __IO  uint32_t                       CAN_INTENCLR;       /* Offset: 0x28 (R/W  32) Interrupt Enable Clear register */
  __IO  uint32_t                       CAN_INTENSET;       /* Offset: 0x2C (R/W  32) Interrupt Enable Set register */
  __IO  uint32_t                       CAN_INTFLAG;        /* Offset: 0x30 (R/W  32) Interrupt Flag Status and Clear register */
  __IO  uint32_t                       CAN_INTFLAGSET;     /* Offset: 0x34 (R/W  32) Interrupt Flag Software Set Register */
  __I   uint8_t                        Reserved2[0x24];
  __I   uint32_t                       CAN_SYNCBUSY;       /* Offset: 0x5C (R/   32) SYNCBUSY Register */
  __I   uint8_t                        Reserved3[0xA0];
  __I   uint32_t                       CAN_CREL_MCAN;      /* Offset: 0x100 (R/   32) Core Release */
  __I   uint32_t                       CAN_ENDN;           /* Offset: 0x104 (R/   32) Endian */
  __IO  uint32_t                       CAN_CUST;           /* Offset: 0x108 (R/W  32) Customer Register */
  __IO  uint32_t                       CAN_DBTP;           /* Offset: 0x10C (R/W  32) Fast Bit Timing and Prescaler */
  __IO  uint32_t                       CAN_TEST;           /* Offset: 0x110 (R/W  32) Test */
  __IO  uint32_t                       CAN_RWD;            /* Offset: 0x114 (R/W  32) RAM Watchdog */
  __IO  uint32_t                       CAN_CCCR;           /* Offset: 0x118 (R/W  32) CC Control */
  __IO  uint32_t                       CAN_NBTP;           /* Offset: 0x11C (R/W  32) Nominal Bit Timing and Prescaler */
  __IO  uint32_t                       CAN_TSCC;           /* Offset: 0x120 (R/W  32) Timestamp Counter Configuration */
  __I   uint32_t                       CAN_TSCV;           /* Offset: 0x124 (R/   32) Timestamp Counter Value */
  __IO  uint32_t                       CAN_TOCC;           /* Offset: 0x128 (R/W  32) Timeout Counter Configuration */
  __IO  uint32_t                       CAN_TOCV;           /* Offset: 0x12C (R/W  32) Timeout Counter Value */
  __I   uint8_t                        Reserved4[0x10];
  __I   uint32_t                       CAN_ECR;            /* Offset: 0x140 (R/   32) Error Counter */
  __I   uint32_t                       CAN_PSR;            /* Offset: 0x144 (R/   32) Protocol Status */
  __IO  uint32_t                       CAN_TDCR;           /* Offset: 0x148 (R/W  32) Extended ID Filter Configuration */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       CAN_IR;             /* Offset: 0x150 (R/W  32) Interrupt */
  __IO  uint32_t                       CAN_IE;             /* Offset: 0x154 (R/W  32) Interrupt Enable */
  __IO  uint32_t                       CAN_ILS;            /* Offset: 0x158 (R/W  32) Interrupt Line Select */
  __IO  uint32_t                       CAN_ILE;            /* Offset: 0x15C (R/W  32) Interrupt Line Enable */
  __I   uint8_t                        Reserved6[0x20];
  __IO  uint32_t                       CAN_GFC;            /* Offset: 0x180 (R/W  32) Global Filter Configuration */
  __IO  uint32_t                       CAN_SIDFC;          /* Offset: 0x184 (R/W  32) Standard ID Filter Configuration */
  __IO  uint32_t                       CAN_XIDFC;          /* Offset: 0x188 (R/W  32) Extended ID Filter Configuration */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       CAN_XIDAM;          /* Offset: 0x190 (R/W  32) Extended ID AND Mask */
  __I   uint32_t                       CAN_HPMS;           /* Offset: 0x194 (R/   32) High Priority Message Status */
  __IO  uint32_t                       CAN_NDAT1;          /* Offset: 0x198 (R/W  32) New Data 1 */
  __IO  uint32_t                       CAN_NDAT2;          /* Offset: 0x19C (R/W  32) New Data 2 */
  __IO  uint32_t                       CAN_RXF0C;          /* Offset: 0x1A0 (R/W  32) Rx FIFO 0 Configuration */
  __I   uint32_t                       CAN_RXF0S;          /* Offset: 0x1A4 (R/   32) Rx FIFO 0 Status */
  __IO  uint32_t                       CAN_RXF0A;          /* Offset: 0x1A8 (R/W  32) Rx FIFO 0 Acknowledge */
  __IO  uint32_t                       CAN_RXBC;           /* Offset: 0x1AC (R/W  32) Rx Buffer Configuration */
  __IO  uint32_t                       CAN_RXF1C;          /* Offset: 0x1B0 (R/W  32) Rx FIFO 1 Configuration */
  __I   uint32_t                       CAN_RXF1S;          /* Offset: 0x1B4 (R/   32) Rx FIFO 1 Status */
  __IO  uint32_t                       CAN_RXF1A;          /* Offset: 0x1B8 (R/W  32) Rx FIFO 1 Acknowledge */
  __IO  uint32_t                       CAN_RXESC;          /* Offset: 0x1BC (R/W  32) Rx Buffer / FIFO Element Size Configuration */
  __IO  uint32_t                       CAN_TXBC;           /* Offset: 0x1C0 (R/W  32) Tx Buffer Configuration */
  __I   uint32_t                       CAN_TXFQS;          /* Offset: 0x1C4 (R/   32) Tx FIFO / Queue Status */
  __IO  uint32_t                       CAN_TXESC;          /* Offset: 0x1C8 (R/W  32) Tx Buffer Element Size Configuration */
  __I   uint32_t                       CAN_TXBRP;          /* Offset: 0x1CC (R/   32) Tx Buffer Request Pending */
  __IO  uint32_t                       CAN_TXBAR;          /* Offset: 0x1D0 (R/W  32) Tx Buffer Add Request */
  __IO  uint32_t                       CAN_TXBCR;          /* Offset: 0x1D4 (R/W  32) Tx Buffer Cancellation Request */
  __I   uint32_t                       CAN_TXBTO;          /* Offset: 0x1D8 (R/   32) Tx Buffer Transmission Occurred */
  __I   uint32_t                       CAN_TXBCF;          /* Offset: 0x1DC (R/   32) Tx Buffer Cancellation Finished */
  __IO  uint32_t                       CAN_TXBTIE;         /* Offset: 0x1E0 (R/W  32) Tx Buffer Transmission Interrupt Enable */
  __IO  uint32_t                       CAN_TXBCIE;         /* Offset: 0x1E4 (R/W  32) Tx Buffer Cancellation Finished Interrupt Enable */
  __I   uint8_t                        Reserved8[0x08];
  __IO  uint32_t                       CAN_TXEFC;          /* Offset: 0x1F0 (R/W  32) Tx Event FIFO Configuration */
  __I   uint32_t                       CAN_TXEFS;          /* Offset: 0x1F4 (R/   32) Tx Event FIFO Status */
  __IO  uint32_t                       CAN_TXEFA;          /* Offset: 0x1F8 (R/W  32) Tx Event FIFO Acknowledge */
  __I   uint8_t                        Reserved9[0x64];
  __I   uint32_t                       CAN_CREL_TSU;       /* Offset: 0x260 (R/   32) TSU CREL */
  __IO  uint32_t                       CAN_TSCFG;          /* Offset: 0x264 (R/W  32) Timestamp Configuration */
  __I   uint32_t                       CAN_TSS1;           /* Offset: 0x268 (R/   32) Timestamp Status 1 */
  __I   uint32_t                       CAN_TSS2;           /* Offset: 0x26C (R/   32) Timestamp Status 2 */
  __I   uint32_t                       CAN_TS0;            /* Offset: 0x270 (R/   32) Timestamp 0 */
  __I   uint32_t                       CAN_TS1;            /* Offset: 0x274 (R/   32) Timestamp 1 */
  __I   uint32_t                       CAN_TS2;            /* Offset: 0x278 (R/   32) Timestamp 2 */
  __I   uint32_t                       CAN_TS3;            /* Offset: 0x27C (R/   32) Timestamp 3 */
  __I   uint32_t                       CAN_TS4;            /* Offset: 0x280 (R/   32) Timestamp 4 */
  __I   uint32_t                       CAN_TS5;            /* Offset: 0x284 (R/   32) Timestamp 5 */
  __I   uint32_t                       CAN_TS6;            /* Offset: 0x288 (R/   32) Timestamp 6 */
  __I   uint32_t                       CAN_TS7;            /* Offset: 0x28C (R/   32) Timestamp 7 */
  __I   uint32_t                       CAN_TS8;            /* Offset: 0x290 (R/   32) Timestamp 8 */
  __I   uint32_t                       CAN_TS9;            /* Offset: 0x294 (R/   32) Timestamp 9 */
  __I   uint32_t                       CAN_TS10;           /* Offset: 0x298 (R/   32) Timestamp 10 */
  __I   uint32_t                       CAN_TS11;           /* Offset: 0x29C (R/   32) Timestamp 11 */
  __I   uint32_t                       CAN_TS12;           /* Offset: 0x2A0 (R/   32) Timestamp 12 */
  __I   uint32_t                       CAN_TS13;           /* Offset: 0x2A4 (R/   32) Timestamp 13 */
  __I   uint32_t                       CAN_TS14;           /* Offset: 0x2A8 (R/   32) Timestamp 14 */
  __I   uint32_t                       CAN_TS15;           /* Offset: 0x2AC (R/   32) Timestamp 15 */
  __IO  uint32_t                       CAN_ATB;            /* Offset: 0x2B0 (R/W  32) Actual Timebase */
} can_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMGC00_CAN_COMPONENT_H_ */
